tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "nrocco/formulae"
tap "universal-ctags/universal-ctags"

brew "autopep8"
brew "bazaar"
brew "bumpversion"
brew "cask"
brew "composer"
brew "coreutils"
brew "curl"
brew "dhcpdump"
brew "direnv"
brew "docutils"
brew "dos2unix"
brew "exiftool"
brew "fd"
brew "flake8"
brew "fping"
brew "fzf"
brew "git"
brew "gnupg"
brew "go"
brew "go-bindata"
brew "graphviz"
brew "httpie"
brew "ipcalc"
brew "iperf"
brew "ipmitool"
brew "jq"
brew "jsonlint"
brew "libvirt"
brew "make"
brew "mas"
brew "minio-mc"
brew "modd"
brew "mtr"
brew "nmap"
brew "node"
brew "nrocco/formulae/consume", args: ["HEAD"]
brew "nrocco/formulae/ide"
brew "nrocco/formulae/soap_client"
brew "nrocco/formulae/tpm"
brew "openconnect"
brew "openssl"
brew "openvpn"
brew "php-cs-fixer"
brew "phpmd"
brew "phpstan"
brew "proselint"
brew "protobuf"
brew "python"
brew "restic"
brew "ripgrep"
brew "rrdtool"
brew "rsync"
brew "siege"
brew "socat"
brew "telnet"
brew "terraform"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "vim"
brew "watch"
brew "wget"
brew "yamllint"
brew "yarn"
brew "zsh"
brew "zsh-completions"

# cask "1password"
cask "appcleaner"
cask "docker"
cask "drawio"
cask "font-source-code-pro"
cask "imageoptim"
cask "iterm2"
# cask "little-snitch"
cask "mattermost"
cask "onyx"
cask "vagrant"
cask "wireshark"
cask "zoomus"

mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "WireGuard", id: 1451685025
