tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "nrocco/formulae"
tap "universal-ctags/universal-ctags"

brew "cask"
brew "coreutils"
brew "curl"
brew "direnv"
brew "docutils"
brew "dos2unix"
brew "exiftool"
brew "fd"
brew "fping"
brew "fzf"
brew "git"
brew "gnupg"
brew "httpie"
brew "ipcalc"
brew "iperf"
brew "jq"
# brew "libvirt"
brew "make"
brew "mas"
brew "minio-mc"
brew "mtr"
brew "nmap"
brew "nrocco/formulae/consume", args: ["HEAD"]
brew "nrocco/formulae/ide"
# brew "nrocco/formulae/soap_client"
# brew "nrocco/formulae/tpm"
brew "openssl"
brew "restic"
brew "ripgrep"
brew "rsync"
brew "siege"
brew "socat"
brew "telnet"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "vim"
brew "watch"
brew "wget"
brew "yamllint"
brew "zsh"
brew "zsh-completions"

# cask "1password"
# cask "appcleaner"
# cask "docker"
# cask "drawio"
## cask "font-source-code-pro"
# cask "imageoptim"
# cask "iterm2"
# cask "little-snitch"
# cask "mattermost"
# cask "onyx"
# cask "vagrant"
# cask "wireshark"
# cask "zoomus"

mas "Microsoft Remote Desktop", id: 1295203466
mas "WireGuard", id: 1451685025
